Autodesk.Revit.DB.IGeometryAugmentationServer.GetAllUsableReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Provides a list of all the ExternalGeometryId that are going to be used with this element.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The ID for the element requested to be attached to this server.
Returns:
Set containing all the ExternalGeometryIds that are going to be used with this element.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServer.ValidateElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Called when a new element is requested to be attached to this server.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The ID for the element requested to be attached to this server.
Returns:
Set to true if the server can work with this element, false otherwise.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServer.GetExtraSpecTypeDependencies(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the list of specs that this server depends on for the generation of the graphics appended for this element.
document:
The document where the target element exists.
target:
The id of the element that will be redrawn if one of the elements that has an id in the returned list changed.
Returns:
Returns the list of specs that this server depends on for the generation of the graphics appended for this element.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServer.GetExtraAppearanceDependencies(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the IDs for the elements that will determine determine a redraw request from this server on the target element.
Remarks:
This function is called when input is required from the external application.
document:
The document where the target element exists.
target:
The id of the element that will be redrawn if one of the elements that has an id in the returned list changed.
Returns:
A list of element IDs for elements that if changed will force a redraw for the target element.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServer.AugmentGeometry(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Returns the graphic data that will be added to the element with the target id.
Remarks:
This function is called when graphics data is required from the external application.
document:
The document where the target element exists.
viewId:
The id of the view-port where this element will be drawn.
target:
The id for the element that will have the extra representation added by this server.
Returns:
Graphics data used by Revit to draw the extra data that the server requires.
Since:
2024

Autodesk.Revit.DB.IGeometryAugmentationServer
Represents an interface that should be overridden by servers that can generate and update data for associated elements.
This is part of the Geometry Augmentation system implementation.
This server was designed to be public_api but in the end it was decided to be moved to public_api_internal
because an element enhanced with this system created by a third party can't be computed when publish the
rvt file into the cloud.
The computation of the value and graphics is done in generateGrep and if the addon the defines the server is not
present it the cell will be empty.
Decision can be found here:
https://autodesk.slack.com/archives/C02KQUH4519/p1673018478447789
https://wiki.autodesk.com/display/aeceng/Public+availability+of+the+Custom+Graphics+API#decision_framework-1761429744
Remarks:
Server interface to drive extra graphics from an external application on elements that attached to it using Autodesk::Revit::DB::GeometryAugmentationRegistry::registerToServer.
Since:
2024